tutorials/incompressibleVoF/forcedUpstreamWave/system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

xBox
{
    type    box;

    coordinates
    {
        type        global;

        e1          (1 0 0);
        e2          (0 1 0);

        directions  (e1);
    }
}

yBox
{
    $xBox;

    coordinates
    {
        directions  (e2);
    }
}

zones
{
    x1
    {
        $xBox;
        box     (-1e6 -40 -1e6) (1300 40 1e6);
    }

    x2
    {
        $xBox;
        box     (-1e6 -30 -1e6) (1200 30 1e6);
    }

    y1
    {
        $yBox;
        box     (-1e6 -40 -1e6) (1e6 40 1e6);
    }

    y2
    {
        $yBox;
        box     (-1e6 -30 -1e6) (1e6 30 1e6);
    }

    y3
    {
        $yBox;
        box     (-1e6 -20 -1e6) (1e6 20 1e6);
    }

    y4
    {
        $yBox;
        box     (-1e6 -10 -1e6) (1e6 10 1e6);
    }
}

// ************************************************************************* //
